{
  "lastUpdated": "2026-02-26T13:18:06.383Z",
  "articles": [
    {
      "id": "94f36ded95c20338",
      "title": "Improving pass rush 'a point of emphasis' for Bears",
      "author": null,
      "source": "Chicago Bears Official",
      "sourceUrl": "https://www.chicagobears.com/news/improving-pass-rush-a-point-of-emphasis-for-bears",
      "publishedAt": "2026-02-26T00:37:00.000Z",
      "excerpt": "The Bears led the NFL with 33 takeaways and 23 interceptions in 2025, but there is one aspect of their defense they are determined to improve.",
      "content": "The Bears led the NFL with 33 takeaways and 23 interceptions in 2025, but there is one aspect of their defense they are determined to improve.",
      "scrapedAt": "2026-02-26T13:17:44.382Z"
    },
    {
      "id": "a42178fc50891e73",
      "title": "Source: Bears allow LB Tremaine Edmunds to seek trade",
      "author": "Courtney Cronin",
      "source": "ESPN",
      "sourceUrl": "https://www.espn.com/nfl/story/_/id/48034214/source-bears-allow-lb-tremaine-edmunds-seek-trade",
      "publishedAt": "2026-02-25T21:45:19Z",
      "excerpt": "The Bears have granted linebacker Tremaine Edmunds permission to find a trade, a source confirmed to ESPN.",
      "content": "Courtney CroninFeb 25, 2026, 02:55 PM ETCloseCourtney Cronin joined ESPN in 2017, originally covering the Minnesota Vikings before switching to the Chicago Bears in 2022. Courtney is a frequent panelist on Around the Horn and host of Best Week Ever and GameNight on ESPN Radio. She also co-hosts The Chicago Bears Podcast on ESPN 1000. She previously worked at the San Jose Mercury News as a multimedia sports journalist.Follow on XMultiple AuthorsEmailPrintOpen Extended ReactionsINDIANAPOLIS -- The Chicago Bears have granted linebacker Tremaine Edmunds permission to seek a trade, a source confirmed to ESPN.Edmunds, 27, is entering the final season of the four-year, $72 million contract he signed with the Bears as a free agent in 2023. His contract carries a $13.9 million base salary for 2026 with a $1 million roster bonus due on the fifth day of the league year. His cap hit is $17.9 million.If Edmunds does not find a trade partner, he is in line to become a cap casualty. Releasing Edmunds would create $15 million in salary cap space for Chicago.\"There's a couple guys we've got to make decisions on,\" Bears general manager Ryan Poles said when asked Tuesday about Edmunds' future.Editor's PicksRanking the NFL's top offseason trade candidates: Who are the best players potentially available?Dan Graziano and Ben SolakBears seeking compensation for Falcons GM hireCourtney Cronin\"If that's trade, release, there's a lot of different options that ... or few options that we can go down to create some space. But like I said before, this is a unique situation where we've gotten our roster in a position where we have a lot of talented players, a lot of guys getting paid well, and that puts some constraints on the cap. So, we got to make some tough decisions. And, you know, like I said, when we win games, you create these relationships. There's leadership guys or guys that were captains that mean a lot to our organization. But when you're kind of put in a corner...\"Edmunds led the Bears with 112 tackles last season to go along with nine passes defended, four interceptions, one sack and a fumble recovery despite missing four games with a groin injury. He also tallied 13 tackles across Chicago's two playoff games.A first-round pick by the Buffalo Bills in 2018, Edmunds has posted at least 102 tackles in each of his eight NFL seasons.The news that the Bears are allowing Edmunds to find a trade was first reported by the Chicago Tribune.",
      "scrapedAt": "2026-02-26T13:17:42.001Z"
    },
    {
      "id": "7f531930ab2e2bc0",
      "title": "Ryan Poles talks building Bears' roster amid cap restrictions",
      "author": null,
      "source": "ESPN",
      "sourceUrl": "https://www.espn.com/video/clip?id=48035123",
      "publishedAt": "2026-02-25T21:43:06Z",
      "excerpt": "Ryan Poles tells Rich Eisen his vision for the Bears' offseason.",
      "content": "Ryan Poles tells Rich Eisen his vision for the Bears' offseason.",
      "scrapedAt": "2026-02-26T13:17:42.000Z"
    },
    {
      "id": "08d9714df3502441",
      "title": "Ben Johnson confident Caleb Williams will keep improving",
      "author": null,
      "source": "Chicago Bears Official",
      "sourceUrl": "https://www.chicagobears.com/news/ben-johnson-confident-caleb-williams-will-keep-improving",
      "publishedAt": "2026-02-25T20:33:00.000Z",
      "excerpt": "Bears coach Ben Johnson watched Caleb Williams make huge strides during their first year together and expects the quarterback to continue to ascend in 2026.",
      "content": "Bears coach Ben Johnson watched Caleb Williams make huge strides during their first year together and expects the quarterback to continue to ascend in 2026.",
      "scrapedAt": "2026-02-26T13:17:44.383Z"
    },
    {
      "id": "d334afa0f2a9182a",
      "title": "2026 draft prospects get important advice from NFL rookies",
      "author": "Sarah Barshop",
      "source": "ESPN",
      "sourceUrl": "https://www.espn.com/nfl/story/_/id/48023893/2025-nfl-rookies-advice-2026-draft-prospects",
      "publishedAt": "2026-02-25T19:27:06Z",
      "excerpt": "As draft prospects begin their combine experience, NFL rookies provide advice based on their personal journeys.",
      "content": "Sarah BarshopFeb 25, 2026, 02:26 PM ETCloseSarah Barshop covers the Los Angeles Rams for ESPN. She joined ESPN in 2016 to cover the Green Bay Packers for ESPN Milwaukee. She then moved to Houston to cover the Texans. She came to ESPN after working as a writer and editor for Sports Illustrated.Follow on XMultiple AuthorsEmailPrintOpen Extended ReactionsWhen Tyler Shough thinks back to the 2025 offseason leading to the NFL draft, he remembers not being \"on anybody's radar.\"Shough endured an injury-filled college career, which lasted seven years and culminated with a solid season at Louisville. He ended up being the third quarterback drafted last year, going to the New Orleans Saints at No. 40 overall. He then played well enough to finish second to the Carolina Panthers' Tetairoa McMillan in Offensive Rookie of the Year voting.\"Just don't listen to anything that anyone's saying [heading into the draft],\" Shough told ESPN. \"I remember when I got picked, there were probably a lot of people upset ...\"I think all the guys coming out, just go through your process, be yourself throughout the whole draft process, be authentic to who you are about your journey, about your shortcomings, all that stuff. And I think it's going to work out the way it's supposed to.\"What to know for the 2026 NFL draft• Mocks: Kiper | Miller | Reid | Yates • Rankings: Kiper | Miller | Reid | Yates • Best by position | Draft order | More ESPN asked 36 NFL rookies to share their biggest piece of advice with 2026 draft prospects, who are gathered in Indianapolis for the annual combine. Here were some of the key pieces of advice, ranging from having a \"no person\" to being patient to -- conversely -- doing things at a \"million miles per hour.\"As far as ignoring predraft analysts, that mindset wasn't difficult for Dallas Cowboys starting right guard Tyler Booker, in part because of what he had learned from his college coach.\"As [former Alabama] Coach [Nick] Saban would say, he would call that rat poison,\" said Booker, the 12th overall pick. \"So I don't even pay attention to that stuff.\"Here's what the aspiring rookies should pay attention to, according to their future peers, as told to the reporters who cover their teams.Designate someone to say 'No'\"I would say having a 'no' person [is the biggest piece of advice],\" said Minnesota Vikings guard Donovan Jackson, who was picked No. 24 overall. \"For me, that was my parents.\"I don't know if people are reaching out to me, but they tell me people are. Just have a 'no' person, because once they see you on an NFL team, they automatically think, 'Oh, he's going to provide.' You can have a 'no' person for that.\"Use the slightest advantage you can find\"Find the small advantages, because everybody's good when you get here,\" said Chicago Bears running back Kyle Monangai, a seventh-rounder who made a big impact with the NFC North champs. \"Even the guys that don't start, they're probably the best athletes you'll ever see.\"So find the small 1%, 2% advantages you can find, because I think those are what separates you since everyone for the most part is on the same talent level, except the freaks like Myles Garrett.\"Never lose your confidence\"Just be the player that they drafted you to be,\" said New York Jets offensive tackle Armand Membou, the seventh overall pick. \"Be the player that got you to this point, being able to get drafted.\"I would say there were times in training camp when I wasn't doing the best, but you just have to keep pushing on and having that next-play mentality and remind yourself that -- at least for me -- remind yourself that I'm here for a reason.\"'Comparison is the thief of joy'\"A lot of people look around and have those chips on your shoulders of who was drafted higher than you,\" said Los Angeles Rams tight end Terrance Ferguson, the 46th overall pick. \"Keep those in mind, but not to watch them and worry about what other people are doing, whether that's in your room, another team, a Team X teammate or whatever. But focus on what your work is and how you can get better and being the best version of yourself.\"I think comparison is the thief of joy, and so just being able to do that day in, day out. It's definitely hard, especially with social media and everything that happens nowadays and being competitive.\"Always go hard\"I would say, just go hard at everything you do,\" said Buffalo Bills defensive tackle T.J. Sanders, who was the 41st overall pick. \"Whether it's in the team periods, games of course, but just make sure everything you do, you're doing a million miles per hour.\"Take everything one day at a time\"You're going to get to a point where you're at the combine and training and be like, 'Man I just miss playing football. I just want to know what team I'm going to be playing on. I just want to get to it,'\" Booker said. \"But really enjoy it, take it one day at a time and then just run your own race.\"Stay patient\"That's a great question for me because I have a little brother that's in college football that hopes to get in the NFL one day,\" said Carolina Panthers linebacker Princely Umanmielen, who went No. 77 overall.Umanmielen's brother, Princewill, is an elite pass rusher who transferred to LSU. He was third-team All-SEC last season at Ole Miss.\"What I would tell him would probably be [stay] patient and consistent,\" Princely said. \"That's really the main things you need your rookie year for sure.'''Listen to the vets'\"Just have confidence in yourself,\" said Washington Commanders wide receiver Jaylin Lane, a fourth-rounder. \"Never lose that.\"Also the vets are [always] doing something, getting extra work or whatever. You need to be right there with them and just listen to the vets. That's my biggest thing.\"Stay balanced\"Definitely know what's ahead of you, because it's going to be a long year,\" said Jets tight end Mason Taylor, who went No. 42. \"As long as you take care of your body, take care of yourself, and when you have off time completely disconnect from it, you'll be just fine.\"I feel like I balanced it pretty well, but off time is pretty important, just to disconnect and get away from football sometimes. It can be overwhelming.\"Put more time into 'mobility' work\"I definitely would have put a lot more time into mobility stuff, like range-of-motion stuff,\" said Eagles defensive tackle Ty Robinson, a fourth-rounder. \"I felt like I was pretty stiff in the beginning.\"Our staff is awesome at being able to help identify certain areas of where you think you can improve. ...You can't be nervous or shy to go ask people for help. That's what they're here to do. And if that means you get to help this place win then it's worth it.\"Best of NFL Nation• 2025 rookie advice for 2026 prospects • O'Connell, Brezinksi as Vikings' next GM? • Could Tyreek, Chiefs be set for a reunion? • Will QB Mac Jones be a 49er next season? • How Ravens' staff is ushering in a new era 'Take care of your body'\"This whole draft process, for me it was a very long process,\" said Jacksonville Jaguars running back Bhayshul Tuten, a fourth-rounder. \"You go from training for combine, then you got pro days and then you got 30 visits and then you got rookie minicamp. Then you go straight into OTAs and stuff like that.\"It's going to be a long year. So take care of your body, stay in shape. Especially taking 30 visits, you want to work out, you want to run and keep your conditioning up. Once you hit rookie minicamp, it's rock and rolling from there.\"So once you get here, you're already beat. I think taking care of your body is the biggest thing because it's going to be a long year. I think once you take care of your body and you just do everything right, keep working out, stay in condition, it'll make it pretty easy for you.\"Additional reporting by Todd Archer, Rich Cimini, Courtney Cronin, Mike DiRocco, Alaina Getzenberg, John Keim, Tim McManus, David Newton, Katherine Terrell, Kevin Seifert, Nick Wagoner and Eric Woodyard.",
      "scrapedAt": "2026-02-26T13:17:42.001Z"
    },
    {
      "id": "4e0cfa351a280c05",
      "title": "Bears present Black History Month Leader Awards",
      "author": null,
      "source": "Chicago Bears Official",
      "sourceUrl": "https://www.chicagobears.com/news/bears-present-black-history-month-leader-awards",
      "publishedAt": "2026-02-25T16:00:00.000Z",
      "excerpt": "The Bears have named Chicago Hope Academy’s Levi Mallette and Antioch Community High School’s Sasha Johnson as recipients of the team’s 2026 Black History Month Youth Leader Awards.",
      "content": "The Bears have named Chicago Hope Academy’s Levi Mallette and Antioch Community High School’s Sasha Johnson as recipients of the team’s 2026 Black History Month Youth Leader Awards.",
      "scrapedAt": "2026-02-26T13:17:44.383Z"
    },
    {
      "id": "2314365724c741f7",
      "title": "Bears promote Press Taylor to offensive coordinator under coach Ben Johnson",
      "author": "Updated [hour]:[minute] [AMPM] [timezone], [monthFull] [day], [year] [deltaHours] hours ago Yesterday [monthFull] [day] [monthFull] [day], [year] [deltaMinutes] mins ago Now",
      "source": "AP News",
      "sourceUrl": "https://apnews.com/article/chicago-bears-press-taylor-offensive-coordinator-9bebc452f33c162042a24016f5626056",
      "publishedAt": null,
      "excerpt": null,
      "content": "LAKE FOREST, Ill. (AP) — The Chicago Bears have promoted pass game coordinator Press Taylor to offensive coordinator to replace the departed Declan Doyle, one of four coaching moves announced by the team on Wednesday.Taylor was Jacksonville’s offensive coordinator from 2022 to 2024. His promotion comes after Doyle left to call plays in Baltimore under new Ravens coach Jesse Minter.Coach Ben Johnson will continue to call plays after the Bears made the playoffs in his first season. Chicago’s offense ranked sixth overall, with quarterback Caleb Williams making big strides in his second year. The No. 1 pick in the 2024 draft, he threw for a franchise-record 3,942 yards with 27 touchdowns and seven interceptions.The Bears were third in rushing, with D’Andre Swift and rookie Kyle Monangai leading the way. Chicago also committed a league-low 11 turnovers. The Bears also hired Eric Studesville as running backs coach, Will Lawing as offensive analyst and Isaiah Ford as offensive quality control coach. A 29-year NFL coaching veteran, Studesville was a Bears assistant in the late 1990s and spent the past eight seasons in Miami, working alongside Johnson for part of that time. Studesville takes over for Eric Bieniemy, who left to become Kansas City’s offensive coordinator. Related Stories Chicago Bears grant linebacker Tremaine Edmunds permission to seek a trade 1 MIN READ Texas Tech’s defensive line reaps benefits at NFL scouting combine 4 MIN READ Titans release center Lloyd Cushenberry and safety Xavier Woods 1 MIN READ Chicago went 11-6 and won its first NFC North title since 2018 after finishing last the previous season. The Bears advanced in the playoffs for the first time in 15 years, rallying to beat Green Bay in a wild-card thriller before losing to the Los Angeles Rams in overtime in the divisional round.___AP NFL: https://apnews.com/hub/nfl",
      "scrapedAt": "2026-02-26T13:17:45.606Z"
    },
    {
      "id": "cd112d554d68fe9c",
      "title": "GM Brian Gutekunst remains encouraged even after Packers’ late-season slide",
      "author": "Updated [hour]:[minute] [AMPM] [timezone], [monthFull] [day], [year] [deltaHours] hours ago Yesterday [monthFull] [day] [monthFull] [day], [year] [deltaMinutes] mins ago Now",
      "source": "AP News",
      "sourceUrl": "https://apnews.com/article/green-bay-packers-1ebc6dece6ba0759aa5861d4aa3cbad5",
      "publishedAt": null,
      "excerpt": null,
      "content": "GREEN BAY, Wis. (AP) — Green Bay general manager Brian Gutekunst remains optimistic about the Packers’ long-term outlook as they head into the offseason after a gut-wrenching playoff loss to the Chicago Bears.But he acknowledges they must do a much better job of finishing games.Gutekunst spoke to reporters Wednesday for the first time since the Packers signed him as well as coach Matt LaFleur and executive vice president/director of football operations Russ Ball to multiyear contract extensions last week. The move by new Packers team president/CEO Ed Policy keeps the Packers’ football leadership triad intact despite a string of disappointing postseason defeats.“In every season, there’s successes, and there’s failures and there’s disappointments,” Gutekunst said. “I was proud of our team in a lot of areas this year, but finishing games is certainly something that we got to concentrate on as we head into 2026.” The Packers (9-8-1) dropped their final five games, including a 31-27 wild-card loss to the Bears in which they blew a 21-3 halftime lead and allowed 25 fourth-quarter points.Green Bay hasn’t reached the Super Bowl since the 2010 team — assembled by GM Ted Thompson, coached by Mike McCarthy and quarterbacked by four-time NFL MVP Aaron Rodgers — won it all. And the team has won only one playoff game since ending the 2020 season with an NFC championship game loss to Tom Brady and the eventual Super Bowl champion Tampa Bay Buccaneers. Related Stories Chicago Bears grant linebacker Tremaine Edmunds permission to seek a trade 1 MIN READ Texas Tech’s defensive line reaps benefits at NFL scouting combine 4 MIN READ Titans release center Lloyd Cushenberry and safety Xavier Woods 1 MIN READ The final loss to the Bears came after the Packers went 9-3-1 to start the season and had a four-point lead entering the fourth quarter of a 34-26 loss to the Denver Broncos on Dec. 14. The Packers had won four in a row at that point, but they watched No. 1 wide receiver Christian Watson leave the stadium in an ambulance after suffering a chest injury, then lost All-Pro edge rusher Micah Parsons to a torn ACL in his left knee later in the game. While Watson returned the following week, Parsons was lost for the season, just as the team had lost emerging star tight end Tucker Kraft to an ACL tear in his right knee in a Nov. 2 loss to the Carolina Panthers.“We were 9-3-1, and I didn’t think we had played particularly great football during the season. I thought we had moments, but I thought we had an opportunity to round into form there in the second half of the season,” Gutekunst said. “And obviously it didn’t work out that way.”And now, the Packers face a challenging offseason full of potential change. Not only did they lose defensive coordinator Jeff Hafley, who left to become the Miami Dolphins head coach, but they have a number of starters and key contributors from their 2022 draft class set to hit free agency in March.Those players who could leave include left tackle Rasheed Walker, middle linebacker Quay Walker, center/guard Sean Rhyan and wide receiver Romeo Doubs. Prized backup quarterback Malik Willis, who played well in place of an injured Jordan Love, also is a free agent and could land a starting opportunity elsewhere. “We have one goal here, and we never run from it. We’re here to win championships,” Gutekunst said. “And I think this team is capable of that.“(The) 2026 (team) will be a different team, but the expectations won’t change. Again, I thought there’s some really good things during the (2025) season. There also were some major disappointments. But I really do like the guys we have in that locker room, the guys that are coming back, and we’ll continue to add to that. And we’re all excited to get at it.”___AP NFL: https://apnews.com/hub/NFL",
      "scrapedAt": "2026-02-26T13:17:45.607Z"
    },
    {
      "id": "cd6e6e216a95b65d",
      "title": "Bears’ Cunningham and 49ers’ Williams are among 4 candidates interviewed in Falcons’ GM search",
      "author": "Updated [hour]:[minute] [AMPM] [timezone], [monthFull] [day], [year] [deltaHours] hours ago Yesterday [monthFull] [day] [monthFull] [day], [year] [deltaMinutes] mins ago Now",
      "source": "AP News",
      "sourceUrl": "https://apnews.com/article/falcons-cunningham-general-manager-aa3a5afb57c5c2aa7bd557c387bb096f",
      "publishedAt": null,
      "excerpt": null,
      "content": "FLOWERY BRANCH, Ga. (AP) — Chicago Bears assistant general manager Ian Cunningham and San Francisco 49ers director of scouting and football operations Josh Williams are among the latest general manager candidates interviewed by the Atlanta Falcons, the team announced Friday.Cunningham and Williams first interviewed for the president of football position given to former longtime quarterback Matt Ryan. That interest makes them considered to be top candidates in the search for a general manager. Ryan is leading the search for the position as the latest step in the makeover of the team leadership.The Falcons on Friday also interviewed Kansas City Chiefs assistant general manager Mike Bradway and Philadelphia Eagles senior personnel director Joe Douglas, the former New York Jets general manager.Owner Arthur Blank fired coach Raheem Morris and general manager Terry Fontenot after an 8-9 finish, the team’s eighth consecutive losing season. The Falcons hired former Cleveland coach Kevin Stefanski to replace Morris. On Thursday, Tommy Rees, who worked on Stefanski’s staff in Cleveland, was named offensive coordinator after Stefanski retained Jeff Ulbrich as defensive coordinator. Cunningham has worked the last four seasons as the Bears’ assistant general manager following five seasons in various roles with the Philadelphia Eagles, including as director of player personnel. Related Stories Chicago Bears grant linebacker Tremaine Edmunds permission to seek a trade 1 MIN READ Texas Tech’s defensive line reaps benefits at NFL scouting combine 4 MIN READ Titans release center Lloyd Cushenberry and safety Xavier Woods 1 MIN READ Cunningham has worked in Chicago with general manager Ryan Poles, who was Ryan’s college teammate at Boston College. Williams has worked the last 15 seasons with the 49ers, including the last two as director of scouting and football operations.Bradway just completed his second season as the Chiefs’ assistant general manager following four seasons as the club’s senior director of player personnel.Douglas was the Eagles’ senior personnel director in 2025 following six seasons as the Jets’ general manager from 2019-24. He previously was Philadelphia’s vice president of player personnel.Ryan and the Falcons previously interviewed Houston Texans assistant general manager James Liipfert and Pittsburgh Steelers assistant general manager Andy Weidl.___AP NFL: https://apnews.com/hub/nfl",
      "scrapedAt": "2026-02-26T13:17:45.607Z"
    },
    {
      "id": "374c999502c66982",
      "title": "Ben Johnson, Bears look ahead after breakthrough season",
      "author": "Updated [hour]:[minute] [AMPM] [timezone], [monthFull] [day], [year] [deltaHours] hours ago Yesterday [monthFull] [day] [monthFull] [day], [year] [deltaMinutes] mins ago Now",
      "source": "AP News",
      "sourceUrl": "https://apnews.com/article/chicago-bears-ryan-poles-ben-johnson-d4a68aee063af9f92d21bd2c692c0330",
      "publishedAt": null,
      "excerpt": null,
      "content": "LAKE FOREST, Ill. (AP) — The Chicago Bears thrilled the city in coach Ben Johnson’s first season. They pulled out one comeback win after another on their way to capturing the NFC North championship after finishing last in the division. They advanced in the playoffs for the first time in 15 years by rallying to beat Green Bay in a wild-card game before losing an overtime thriller to Matthew Stafford and the Los Angeles Rams in the divisional round.Now, it’s time to start building on everything they accomplished. Then again, maybe building isn’t the right word.“There is no building off of this,” Johnson said on Wednesday. “We go back to square one. We’re back at the bottom again. That’s really all 32 teams. If you feel otherwise, you’re probably missing the big picture.”The Bears are obviously starting from a stronger position, with Caleb Williams on his way to becoming a franchise quarterback after setting the team’s single-season passing record in his second year and Johnson looking like the coach to lead him to that next level. It’s a big change from last January, when the team was reeling after finishing 5-12 and firing former coach Matt Eberflus along the way. Now, for the first time since he was hired in 2022, general manager Ryan Poles heads into the offseason with a contender rather than a rebuilding project. Related Stories Chicago Bears grant linebacker Tremaine Edmunds permission to seek a trade 1 MIN READ Texas Tech’s defensive line reaps benefits at NFL scouting combine 4 MIN READ Titans release center Lloyd Cushenberry and safety Xavier Woods 1 MIN READ “You just have more constraints,” he said. “At the same time, I don’t think the process changes. You’re gonna identify the guys that fit what we want in our football team, which coach hit, and you just keep trying to acquire those players. We know what they look like, we know how they act, we know how they talk, and we’ll continue to do that.” Poles had a big offseason a year ago.He transformed a struggling offensive line by trading for guards Joe Thuney and Jonah Jackson and signing center Drew Dalman. He also drafted Ozzy Trapilo in the second round. The Boston College product emerged as the starting left tackle, only to tear the patellar tendon in his left knee in the wild-card game against Green Bay. Poles didn’t have a specific timeline for his return, though he figures to be out long term after having surgery.“I’m sure it’ll be deep into next (season), with the injury,” Poles said. “So, we’ve had a conversation with him. He knows this is part of his journey that he has to overcome. I have a lot of faith in him and our staff to get him back ready to go whenever that is.”Trapilo was one of four major contributors drafted by Poles this past year.The Bears also hit big with tight end Colston Loveland in the first round, receiver Luther Burden in the second and running back Kyle Monangai in the seventh. Loveland, the No. 10 pick out of Michigan, led Chicago in receptions (58) and yards (713) and tied for the team lead in touchdown catches (six). The speedy and elusive Burden had 652 yards receiving. And the hard-running Monangai rushed for 783 yards as part of a productive tandem with D’Andre Swift.The Bears have some decisions to make at safety with All-Pro Kevin Byard and Jaquan Brisker set to become free agents. The 32-year-old Byard, who led the league with seven interceptions, said this week he’d like to return. And Poles would like to have him back. “I have no problem saying that’s a player that we would like to have back,” Poles said. “But, again, when you add the other safeties into that mix and all the other decisions we have across the roster, with cap restraints and things like that, it’ll be a challenge. But that’s part of what we do.”Poles also acknowledged a need to improve the line on a defense that ranked 29th overall and 27th against the run. Chicago tied for 22nd in sacks with 35. But the Bears appear to have the two most important pieces in place — the coach and the quarterback.“I’m really encouraged about the steps he took this year,” Johnson said. “I’m Caleb Williams’ No. 1 believer. I have a lot of faith in him and what he’s capable of doing and the player that he’s still striving to become.”___AP NFL: https://apnews.com/hub/nfl",
      "scrapedAt": "2026-02-26T13:17:45.608Z"
    },
    {
      "id": "53269b676a58df39",
      "title": "Caleb Williams and the Bears see bigger things in store after making strides under Ben Johnson",
      "author": "Updated [hour]:[minute] [AMPM] [timezone], [monthFull] [day], [year] [deltaHours] hours ago Yesterday [monthFull] [day] [monthFull] [day], [year] [deltaMinutes] mins ago Now",
      "source": "AP News",
      "sourceUrl": "https://apnews.com/article/chicago-bears-wrapup-10ded0484743e6a88c6dd3107970a0d6",
      "publishedAt": null,
      "excerpt": null,
      "content": "LAKE FOREST, Ill. (AP) — There were all sorts of thoughts running through Caleb Williams’ mind as he drove home after the Chicago Bears’ gut-wrenching playoff exit.One thing that jarred him was the realization that instead of reviewing video on Monday, he and his teammates would be clearing out their lockers. Williams also felt a strong sense of gratitude in the wake of the Bears’ 20-17 overtime loss to the Los Angeles Rams in the divisional round on Sunday night.“To bring life, to bring joy, to bring excitement, to being a Chicago Bears fan, to be able to cheer for us,” Williams said Monday. “I do take pride in it. It’s really cool, honestly, to be able to have those small things like that. Just being able to have the city behind you. You lose that game, you’re walking out of the game and the fans stand up and cheer and roar in a tough moment. It goes a long way.” The Bears came a long way under first-year coach Ben Johnson. They went 11-6 and won their first NFC North title since 2018 after finishing last a year ago and advanced in the playoffs for the first time in 15 years. Along the way, they provided plenty of thrills. Related Stories Chicago Bears grant linebacker Tremaine Edmunds permission to seek a trade 1 MIN READ Texas Tech’s defensive line reaps benefits at NFL scouting combine 4 MIN READ Titans release center Lloyd Cushenberry and safety Xavier Woods 1 MIN READ Chicago pulled out an NFL-record seven wins when trailing in the final two minutes of regulation, including a thriller against Green Bay in the wild-card round. And on Sunday, it looked like the Bears might have one more rally in them. Williams made an incredible touchdown throw in the closing seconds of regulation. But on his last pass of the game, a miscommunication with DJ Moore led to an interception. Matthew Stafford then drove the Rams into position for the winning field goal.Instead of preparing for a trip to Seattle for the NFC championship game, Chicago turns its attention toward the offseason. The Bears are in a far better place than they were a year ago. Williams looks to improve his accuracyWilliams made big strides in his second season and first in Johnson’s system, passing for a franchise-record 3,942 yards with 27 touchdowns and seven interceptions. His accuracy remains an issue, and that’s something he plans to address in the offseason.Williams completed 58.1% of his passes and ranked 24th among qualifying players. The only other quarterback below 60% was Tennessee’s Cam Ward at 59.8%.“Was I too far forward? Was I too far back?” Williams said. “Was I not consistent enough with my footwork and did I lean off and fall off the mound, is what we call it? Things like that.”Bears are set along the offensive lineThe Bears don’t have to worry about their offensive line this offseason. That’s a big change from recent years.General manager Ryan Poles rebuilt the interior of the line by trading for guards Joe Thuney and Jonah Jackson and signing center Drew Dalman. He also drafted Ozzy Trapilo in the second round.Thuney, acquired from Kansas City, was first-team All-Pro for the third time. Dalman earned his first Pro Bowl selection. Jackson started every game, and Trapilo emerged as the starting left tackle during the season. With Darnell Wright, a second-team All-Pro, at right tackle, the Bears’ line was one of the league’s best. All five players are under contract for next year.“We just had exit interviews — like you talk to the coaches and you have a clear view of, here are my deficiencies, here’s what needs to get better and what do we need to do as a group better,” Dalman said. “And so I think when you have all those guys that experienced those mistakes together in the past, it makes it all the more like poignant next year when we’re trying to address them.”Improving defensive line could be a focusThe Bears could use some help up front on defense. They were prone to giving up long drives, and when it came to taking down the quarterback, they were near the bottom of the NFL. With 35 sacks, they finished in a five-way tie for 22nd place. Turnover at safety?Safeties Kevin Byard and Jaquan Brisker are on expiring contracts. The 32-yeard-old Byard said he “would love” to re-sign with the Bears, with his two-year contract set to expire following one of his best seasons. He earned his third first-team All-Pro selection while leading the NFL in interceptions for the second time in his career. He picked off seven passes, one shy of his career high with Tennessee in 2017.Byard said he wanted to prove he was still an elite player when he signed with Chicago after being released by Philadelphia. He played a huge role in the Bears leading the league in interceptions (23), takeaways (33) and turnover differential (plus-22).“I really enjoyed this season and I would love to be back,” he said.Brisker stayed healthy in his fourth season, playing a career-high 17 games after missing the final 12 in 2024 due to a concussion. He had a sack and two passes defensed against Los Angeles.Next stepsThe Bears are bullish on their future. They believe they have the right coach and quarterback, and they can now entice free agents to join a winner.___AP NFL: https://apnews.com/hub/NFL",
      "scrapedAt": "2026-02-26T13:17:45.610Z"
    },
    {
      "id": "bc94346c7a1230e7",
      "title": "Bears promote longtime scout, executive Jeff King to assistant general manager",
      "author": "Updated [hour]:[minute] [AMPM] [timezone], [monthFull] [day], [year] [deltaHours] hours ago Yesterday [monthFull] [day] [monthFull] [day], [year] [deltaMinutes] mins ago Now",
      "source": "AP News",
      "sourceUrl": "https://apnews.com/article/chicago-bears-assistant-gm-jeff-king-bcd17e45bbd2bb2cd77c335dde9d53a8",
      "publishedAt": null,
      "excerpt": null,
      "content": "LAKE FOREST, Illinois (AP) — The Chicago Bears promoted longtime scout and front office executive Jeff King to assistant general manager under Ryan Poles on Thursday.King’s promotion comes after Ian Cunningham left late last month to become Atlanta’s general manager. The Bears hired King in 2015 as a scouting intern and he worked his way up to senior director of player personnel last season. A tight end, King played in the NFL from 2006 to 2012 for Carolina and Arizona. He caught 156 passes for 1,323 and 12 touchdowns. Chicago went 11-6 and won its first NFC North title since 2018 after finishing last the previous season. The Bears advanced in the playoffs for the first time in 15 years, rallying to beat Green Bay in a wild-card thriller before losing to the Los Angeles Rams in overtime in the divisional round.___AP NFL: https://apnews.com/hub/nfl",
      "scrapedAt": "2026-02-26T13:17:45.608Z"
    },
    {
      "id": "3cc050b77c76cb5d",
      "title": "Super Bowl History, 3rd Add",
      "author": "Updated [hour]:[minute] [AMPM] [timezone], [monthFull] [day], [year] [deltaHours] hours ago Yesterday [monthFull] [day] [monthFull] [day], [year] [deltaMinutes] mins ago Now",
      "source": "AP News",
      "sourceUrl": "https://apnews.com/article/terry-bradshaw-nfl-super-bowl-joe-montana-football-bart-starr-f2b5fb4f469f272c4952d9573b1c5f1a",
      "publishedAt": null,
      "excerpt": null,
      "content": "Super Bowl XXIIIJan. 22, 1989At Miami_75,129Cincinnati0310316San Francisco3031420After a week of riots within Miami, San Francisco captured its third Super Bowl of the 1980s and became the first NFC team to win three times.The 49ers outgained the Bengals 454 to 229, but found themselves trailing late in the game. Jim Breech’s 40-yard field goal, with 3:20 remaining gave Cincinnati a 16-13 lead.San Francisco started the winning drive at its 8-yard line, with quarterback Joe Montana (“Joe Cool”) famously scanning the crowd at the beginning of the march and telling his teammates, “Look, there’s John Candy.”Then Montana took apart Cincinnati’s defense. On the 11th play of the series, Montana hit John Taylor with a 10-yard pass over middle for the winning touchdown with 34 seconds remaining.At halftime, the score was 3-3, the first time in Super Bowl history the game was tied at intermission. Both teams exchanged field goals and Stanford Jennings’ 93-yard kickoff return gave the Bengals a 13-6 lead with 4 seconds remaining in the third quarter. The 49ers came back with an 85-yard drive in four plays, concluding with Montana’s 14-yard pass to Jerry Rice. Rice was voted the most valuable player after catching 11 passes for a record 215 yards. Montana completed 23 of 36 passes for a record 357 yards. ___Super Bowl XXIIJan. 31, 1988At San Diego_73,302Washington0350742Denver1000010The Washington Redskins, with the greatest quarter in NFL playoff history, scored 35 points in the second period to overcome a 10-0 deficit and win their second Super Bowl championship. John Elway threw a 56-yard touchdown pass to Ricky Nattiel on the Broncos’ first play from scrimmage and Rich Karlis kicked a 24-yard field goal on the next possession to take a 10-0 lead.The Redskins scored five touchdowns on consecutive possessions in the second quarter, four on passes by MVP Doug Williams, who set a record with 340 yards passing in the game. Washington scored the five touchdowns in 18 plays with a total time of possession of only 5:47. Williams became the first African-American quarterback to win a Super Bowl.Tim Smith, a rookie backup who gained 126 yards for the entire season, was given the start by Redskins coach Joe Gibbs. Smith rushed for a record 204 yards. Ricky Sanders caught nine passes for 193 yards and two touchdowns, breaking one record and tying another.Just as in the 1982 season, the Redskins won the title in a season shortened by a players’ strike.___Super Bowl XXIJan. 25, 1987At Pasadena, Calif._101,063Denver10001020N.Y. Giants72171339Phil Simms led the New York Giants to a 30-point second half to beat the Denver Broncos, winning their first Super Bowl and first NFL championship in 30 years.Simms completed 22 of 25 for 268 yards, including three touchdown passes, and was unanimously voted the Most Valuable Player. He also set a Super Bowl record with 10 straight completions during New York’s second-half tear. His 88 percent completion rate was an NFL playoff record.John Elway, in his first of five Super Bowls, helped Denver to a 10-9 halftime lead. New York started the second half with three plays for 9 yards, and the Giants’ punting team ran onto the field at its 46. Suddenly, the Giants shifted out of punt formation, and Jeff Rutledge, the second-string quarterback, came up behind center to take the snap and sneak for 1 yard and a first down. Six plays later, Simms hit tight end Mark Bavaro for 13 yards, the Giants led 16-10 and the rout was on. ___Super Bowl XXJan. 26, 1986At New Orleans_73,818Chicago131021246New England300710The Monsters of the Midway in all their overpowering glory.And with some brashness: several players made a music video, the “Super Bowl Shuffle,” before heading to New Orleans.The Chicago Bears won their first NFL championship since 1963 by setting a Super Bowl record for points scored in defeating the Patriots 46-10. The NFC champions, who won by the largest margin in Super Bowl history, broke the mark for points in a game set by San Francisco and the Los Angeles Raiders in the previous two Super Bowls.New England capitalized on a Chicago fumble to score the quickest points in Super Bowl history on Tony Franklin’s field goal 74 seconds after kickoff. That just made the Bears mad, and they scored 44 straight points. The Bears’ defense, which allowed only 10 points in postseason play, held New England to 7 yards rushing and 116 yards passing.Jim McMahon, who passed for 256 yards, became the first quarterback to rush for two touchdowns. Richard Dent, who contributed 1 1/2 sacks, was voted the Most Valuable Player.Chicago all-time great running back Walter Payton didn’t score, but defensive tackle William “Refrigerator” Perry had a 1-yard TD run.___Super Bowl XIXJan. 20, 1985At Palo Alto, Calif._84,059Miami1060016San Francisco72110038Billed as a matchup of the NFL’s top two quarterbacks, Joe Montana (and his defense) easily got the better of Dan Marino.Montana completed 24 of 35 passes and threw for a Super Bowl record 331 yards and three touchdowns. He also rushed five times for 59 yards and a touchdown. Running back Roger Craig caught two of Montana’s touchdown passes and ran for another to set a Super Bowl record. The San Francisco defense sacked the record-setting Marino four times in the game and held the Dolphins to 25 yards rushing.Montana joined Green Bay’s Bart Starr and Pittsburgh’s Terry Bradshaw as the only two-time Super Bowl most valuable players. Montana was the MVP in the 1982 Super Bowl against Cincinnati.Marino would never make the Super Bowl again in his Hall of Fame career.___Super Bowl XVIIIJan. 22, 1984At Tampa, Fla._72,920Washington03609Los Angeles71414338Marcus Allen rushed for a Super Bowl-record 191 yards on 20 carries and scored two touchdowns as the Raiders trounced the Redskins, 38-9.The Raiders took a 7-0 lead 4:52 into the game when Derrick Jensen blocked Jeff Hayes’ punt and recovered it in the end zone for a touchdown.Jim Plunkett hooked up with Cliff Branch for a 12-yard TD pass and a 14-0 lead. Washington cut the margin to 14-3 on a 24-yard field goal by Mark Moseley, but with 7 seconds left in the half, Washington coach Joe Gibbs called for a screen pass. Raiders linebacker Jack Squirek saw it coming and intercepted Joe Theismann’s throw, jogging 5 yards into the end zone to give Los Angeles a commanding 21-3 halftime advantage.Allen, voted the game’s most valuable player, scored on runs of 5 and 74 yards, the latter a Super Bowl record and a brilliant effort, putting the Raiders ahead 35-9.___Super Bowl XVIIJan. 30, 1983At Pasadena, Calif._103,667Miami7100017Washington01031427Fullback John Riggins churned out a Super Bowl-record 166 yards on 38 carries to spark the Redskins to a come-from-behind 27-17 win over the Dolphins.For Riggins, voted the game’s most valuable player, it was his fourth consecutive 100-yard rushing game during the playoffs, also a record.Riggins gave the Redskins their first lead with 10:01 remaining when he ran 43 yards off left tackle for a touchdown on fourth-and-1.The Dolphins had built a 17-10 halftime lead on a 76-yard touchdown pass from David Woodley to wide receiver Jim Cefalo in the first quarter; a 20-yard field goal by Uwe von Schamann; and a Super Bowl-record 98-yard kickoff return by Fulton Walker just before halftime.Mark Moseley cut the Miami lead to 17-13 with a 20-yard field goal in the third quarter.After Riggins’ run put the Redskins on top, Theismann capped the scoring with a 6-yard pass to wide receiver Charlie Brown with 1:55 left.The Redskins and Dolphins survived a strike-shortened season to reach the Super Bowl.___Super Bowl XVIJan. 24, 1982At Pontiac, Mich._81,270San Francisco7136026Cincinnati0071421The first Super Bowl held in a cold-weather city — but in the Pontiac Silverdome — was preceded by the 49ers’ bus getting caught in traffic and several players needing to walk into the stadium.Didn’t bother them much: Ray Wersching kicked a Super Bowl record-tying four field goals to help lift the 49ers to their first NFL championship with a 26-21 win over the Bengals.The 49ers built a game-record 20-0 halftime lead on the strength of two long touchdown marches led by Joe Montana, and two Wersching field goals.The Bengals came back in the second half, narrowing the margin to 20-14 on quarterback Ken Anderson’s 5-yard run and 4-yard scoring toss to Dan Ross. But Wersching connected on early third-quarter field goals of 40 and 23 yards to increase the 49ers’ lead to 26-14, making meaningless Anderson’s 3-yard touchdown pass to Ross (who set a Super Bowl record with 11 receptions for 104 yards) in the final seconds.Montana completed 14 of 22 passes for 157 yards; Anderson established game records for completions (25) and completion percentage (73.5 percent on 25 of 34).___Super Bowl XVJan. 25, 1981At New Orleans_76,135Oakland14010327Philadelphia030710Jim Plunkett’s two first-quarter touchdown passes, including a Super Bowl-record 80-yard strike to running back Kenny King, led the Raiders.Philadelphia, which had defeated Oakland 10-7 several weeks earlier, never got on track until late in the third quarter. Linebacker Rod Martin set up Oakland’s first touchdown with his first of three interceptions, a Super Bowl record for one player.Before the first quarter ended the Raiders upped their lead to 14-0 when Plunkett hit King near midfield to record the longest play in Super Bowl history. In all, Plunkett completed 13 of 21 passes for 261 yards and three touchdowns. The game capped a storybook season for Plunkett, the game’s MVP.The journeyman quarterback took over the reins of the Raiders’ offense and won nine of the last 11 regular-season games. In the playoffs, the Raiders beat Houston, San Diego and Cleveland en route to becoming the first wild-card team to win the Super Bowl.___Super Bowl XIVJan. 20, 1980At Pasadena, Calif._103,985Los Angeles766019Pittsburgh3771431The Steel Curtain dynasty concluded as Terry Bradshaw completed 14 of 21 passes for 309 yards and set two passing records as the Steelers became the first team to win four Super Bowls.Despite three interceptions by the Rams, Bradshaw brought the Steelers from behind twice in the second half. Trailing 13-10 at halftime, Pittsburgh went ahead 17-13 when Bradshaw connected with Lynn Swann for a 47-yard touchdown early in the third quarter.On the Rams’ next possession, Vince Ferragamo responded with a 50-yard pass to Billy Waddy that moved Los Angeles to the Steelers 24. On the following play, Lawrence McCutcheon connected with Ron Smith on a halfback option pass that gave the Rams a 19-17 lead.On Pittsburgh’s initial possession of the fourth quarter, Bradshaw lofted a gorgeous 73-yard scoring pass to John Stallworth to put the Steelers in front to stay, 24-19. A 45-yard pass from Bradshaw to Stallworth was the key play in Pittsburgh’s final scoring drive, which was culminated by Franco Harris’ second 1-yard TD of the game.Bradshaw, the game’s MVP for the second straight year, set Super Bowl records for most touchdown passes (nine) and most passing yards (932).The Steelers would not win another Super Bowl for a quarter-century.___Super Bowl XIIIJan. 21, 1979At Miami_79,484Pittsburgh71401435Dallas7731431In one of the most exciting Super Bowls, Terry Bradshaw threw four touchdown passes to lead the Steelers to their third win. Bradshaw, voted the game’s most valuable player, completed 17 of 30 passes for 318 yards, breaking Bart Starr’s record of 250 yards passing by halftime.Two Bradshaw-to-John Stallworth and one Bradshaw-to-Rocky Bleier throws in the first half gave Pittsburgh a 21-14 lead at halftime.Franco Harris ran 22 yards for a score after Rafael Septein had cut Pittsburgh’s lead to 21-17 with a field goal. Pittsburgh then seemingly put the game out of reach with less than seven minutes to play when Bradshaw hit Lynn Swann for an 18-yard TD strike to make the score 35-17.But Roger Staubach threw his second scoring pass of the game with 2:23 left, a 7-yarder to Billy Joe DuPree. The Cowboys then recovered an onside kick and scored again on Staubach’s third TD pass with 22 seconds remaining.Dallas’ bid for another onside kick recovery and a miracle comeback failed as Rocky Bleier fell on the ensuing kickoff with 17 seconds left.MORE-Super Bowl XXIIIJan. 22, 1989At Miami_75,129Cincinnati0310316San Francisco3031420___Super Bowl XXIIJan. 31, 1988At San Diego_73,302Washington0350742Denver1000010___Super Bowl XXIJan. 25, 1987At Pasadena, Calif._101,063Denver10001020N.Y. Giants72171339___Super Bowl XXJan. 26, 1986At New Orleans_73,818Chicago131021246New England300710___Super Bowl XIXJan. 20, 1985At Palo Alto, Calif._84,059Miami1060016San Francisco72110038___Super Bowl XVIIIJan. 22, 1984At Tampa, Fla._72,920Washington03609Los Angeles71414338___Super Bowl XVIIJan. 30, 1983At Pasadena, Calif._103,667Miami7100017Washington01031427___Super Bowl XVIJan. 24, 1982At Pontiac, Mich._81,270San Francisco7136026Cincinnati0071421___Super Bowl XVJan. 25, 1981At New Orleans_76,135Oakland14010327Philadelphia030710___Super Bowl XIVJan. 20, 1980At Pasadena, Calif._103,985Los Angeles766019Pittsburgh3771431___Super Bowl XIIIJan. 21, 1979At Miami_79,484Pittsburgh71401435Dallas7731431",
      "scrapedAt": "2026-02-26T13:17:45.609Z"
    },
    {
      "id": "48dfb02804916a02",
      "title": "Ravens’ Minter praises new offensive coordinator Declan Doyle’s ‘innovative mindset’",
      "author": "Updated [hour]:[minute] [AMPM] [timezone], [monthFull] [day], [year] [deltaHours] hours ago Yesterday [monthFull] [day] [monthFull] [day], [year] [deltaMinutes] mins ago Now",
      "source": "AP News",
      "sourceUrl": "https://apnews.com/article/baltimore-ravens-declan-doyle-0dc06f43f0e36dd21b198e8909c77879",
      "publishedAt": null,
      "excerpt": null,
      "content": "OWINGS MILLS, Md. (AP) — Declan Doyle doesn’t turn 30 until next month.He’s already one of the NFL’s most important assistant coaching hires of this offseason.The Baltimore Ravens made it official Monday. They’ve hired Doyle to be their offensive coordinator. He takes over a unit that was phenomenal in 2024 before regressing this season as two-time MVP quarterback Lamar Jackson dealt with injury problems.Doyle was born almost exactly 10 months before Jackson.“An architect of offense, Declan will build around our players through communication, collaboration, relationships and trust,” Jesse Minter, who was hired to replace John Harbaugh as Baltimore’s coach, said in a statement. “His innovative mindset, collaborative spirit, team-first approach and extensive NFL experience make him an outstanding addition to the Ravens organization.” Doyle was previously the offensive coordinator for the Chicago Bears under Ben Johnson. Chicago improved into a playoff team this season, with second-year quarterback Caleb Williams taking significant steps forward.Now Doyle will have a crucial role with Baltimore, with Minter planning to call the defense. The 2024 Ravens averaged 6.85 yards per play, the third most in NFL history, and set a league record with 5.76 yards per rush.But Baltimore slipped to an 8-9 record this season and missed the playoffs, resulting in Harbaugh’s firing.___AP NFL: https://apnews.com/hub/NFL",
      "scrapedAt": "2026-02-26T13:17:45.609Z"
    },
    {
      "id": "86079acb4a240926",
      "title": "National Football Conference Champions",
      "author": "Updated [hour]:[minute] [AMPM] [timezone], [monthFull] [day], [year] [deltaHours] hours ago Yesterday [monthFull] [day] [monthFull] [day], [year] [deltaMinutes] mins ago Now",
      "source": "AP News",
      "sourceUrl": "https://apnews.com/article/football-new-york-san-francisco-chicago-bears-dallas-66489a902caf747836f1f8073e440fd0",
      "publishedAt": null,
      "excerpt": null,
      "content": "2025_Seattle 31, L.A. Rams 272024_Philadelphia 55, Washington 232023_San Francisco 34, Detroit 312022_Philadelphia 31, San Francisco 72021_L.A. Rams 20, San Francisco 172020_Tampa Bay 31, Green Bay 262019_San Francisco 37, Green Bay 202018_L.A. Rams 26, New Orleans 23, OT2017_Philadelphia 38, Minnesota 72016_Atlanta 44, Green Bay 212015_Carolina 49, Arizona 152014_Seattle 28, Green Bay 22, OT2013_Seattle 23, San Francisco 172012_San Francisco 28, Atlanta 242011_N.Y. Giants 20, San Francisco 17, OT2010_Green Bay 21, Chicago 142009_New Orleans 31, Minnesota 28, OT2008_Arizona 32, Philadelphia 252007_New York 23, Green Bay 20, OT2006_Chicago 39, New Orleans 142005_Seattle 34, Carolina 142004_Philadelphia 27, Atlanta 102003_Carolina 14, Philadelphia 32002_Tampa Bay 27, Philadelphia 102001_St. Louis 29, Philadelphia 242000_New York 41, Minnesota 0 1999_St. Louis 11, Tampa Bay 61998_Atlanta 30, Minnesota 27, OT1997_Green Bay 23, San Francisco 101996_Green Bay 30, Carolina 131995_Dallas 38, Green Bay 271994_San Francisco 38, Dallas 281993_Dallas 38, San Francisco 211992_Dallas 30, San Francisco 20 Related Stories Chicago Bears grant linebacker Tremaine Edmunds permission to seek a trade 1 MIN READ Texas Tech’s defensive line reaps benefits at NFL scouting combine 4 MIN READ University of Cincinnati sues ex-QB Brendan Sorsby after his transfer to Texas Tech 3 MIN READ 1991_Washington 41, Detroit 101990_New York 15, San Francisco 131989_San Francisco 30, L.A. Rams 31988_San Francisco 28, Chicago 31987_Washington 17, Minnesota 101986_New York 17, Washington 01985_Chicago 24, L.A. Rams 01984_San Francisco 23, Chicago 01983_Washington 24, San Francisco 21 1982_Washington 31, Dallas 171981_San Francisco 28, Dallas 271980_Philadelphia 20, Dallas 71979_L.A. Rams 9, Tampa Bay 01978_Dallas 28, L.A. Rams 01977_Dallas 23, Minnesota 61976_Minnesota 24, L.A. Rams 131975_Dallas 37, L.A. Rams 71974_Minnesota 14, L.A. Rams 101973_Minnesota 27, Dallas 101972_Washington 26, Dallas 31971_Dallas 14, San Francisco 31970_Dallas 17, San Francisco 101969_Minnesota 27, Cleveland Browns 71968_Baltimore 34, Cleveland Browns 0 1967_Green Bay 21, Dallas 171966_Green Bay 34, Dallas 271965_Green Bay 23, Cleveland Browns 121964_Cleveland Browns 27, Baltimore 01963_Chicago Bears 14, New York 101962_Green Bay 16, New York 71961_Green Bay 37, New York 01960_Philadelphia 17, Green Bay 131959_Baltimore 31, New York 161958_Baltimore 23, New York 17, OT1957_Detroit 59, Cleveland Browns 141956_New York 47, Chicago Bears 71955_Cleveland Browns 38, Los Angeles 141954_Cleveland Browns 56, Detroit 101953_Detroit 17, Cleveland Browns 161952_Detroit 17, Cleveland Browns 71951_Los Angeles 24, Cleveland Browns 171950_Cleveland Browns 30, Los Angeles 281949_Philadelphia 14, Los Angeles 01948_Philadelphia 7, Chicago Cardinals 01947_Chicago Cardinals 28, Philadelphia 211946_Chicago Bears 24, New York 141945_Cleveland Rams 15, Washington 141944_Green Bay 14, New York 71943_Chicago 41, Washington 211942_Washington 14, Chicago Bears 61941_Chicago Bears 37, New York 91940_Chicago Bears 73, Washington 01939_Green Bay 27, New York 01938_New York 23, Green Bay 171937_Washington 28, Chicago Bears 211936_Green Bay 21, Boston 61935_Detroit 26, New York 71934_New York 30, Chicago Bears 131933_Chicago Bears 23, New York 21",
      "scrapedAt": "2026-02-26T13:17:45.610Z"
    },
    {
      "id": "c02593fa48055f4e",
      "title": "Caleb Williams’ ‘ridiculous’ TD pass draws raves from his coach and teammates after Bears’ loss",
      "author": "Updated [hour]:[minute] [AMPM] [timezone], [monthFull] [day], [year] [deltaHours] hours ago Yesterday [monthFull] [day] [monthFull] [day], [year] [deltaMinutes] mins ago Now",
      "source": "AP News",
      "sourceUrl": "https://apnews.com/article/bears-caleb-williams-touchdown-pass-03f40e7765c8732feaa5c5c2003770a9",
      "publishedAt": null,
      "excerpt": null,
      "content": "",
      "scrapedAt": "2026-02-26T13:17:45.611Z"
    },
    {
      "id": "f2c34d3ba7e80a98",
      "title": "Rams shake off wild, late TD pass by Caleb Williams, beat Bears 20-17 in OT to reach NFC title game",
      "author": "Updated [hour]:[minute] [AMPM] [timezone], [monthFull] [day], [year] [deltaHours] hours ago Yesterday [monthFull] [day] [monthFull] [day], [year] [deltaMinutes] mins ago Now",
      "source": "AP News",
      "sourceUrl": "https://apnews.com/article/rams-bears-score-8e97bcf5c6bdfa7510cf31d744b94955",
      "publishedAt": null,
      "excerpt": null,
      "content": "",
      "scrapedAt": "2026-02-26T13:17:45.611Z"
    },
    {
      "id": "36afd3c1e72fd0cc",
      "title": "Matthew Stafford and Rams visit Caleb Williams and Bears in matchup of high-powered offenses",
      "author": "Updated [hour]:[minute] [AMPM] [timezone], [monthFull] [day], [year] [deltaHours] hours ago Yesterday [monthFull] [day] [monthFull] [day], [year] [deltaMinutes] mins ago Now",
      "source": "AP News",
      "sourceUrl": "https://apnews.com/article/rams-bears-preview-capsule-d6505e1e26f3108ecc99a0e47a1ebdf4",
      "publishedAt": null,
      "excerpt": null,
      "content": "",
      "scrapedAt": "2026-02-26T13:17:45.611Z"
    },
    {
      "id": "5d25ea76faf2e767",
      "title": "Rams collide with resurgent Bears in divisional round matchup featuring high-powered offenses",
      "author": "Updated [hour]:[minute] [AMPM] [timezone], [monthFull] [day], [year] [deltaHours] hours ago Yesterday [monthFull] [day] [monthFull] [day], [year] [deltaMinutes] mins ago Now",
      "source": "AP News",
      "sourceUrl": "https://apnews.com/article/rams-bears-preview-nfl-playoffs-443820cd8b60dc8006df89ab8bcec49a",
      "publishedAt": null,
      "excerpt": null,
      "content": "",
      "scrapedAt": "2026-02-26T13:17:45.612Z"
    },
    {
      "id": "0968027b39a632cb",
      "title": "After Michael Jordan moment, Bears’ Caleb Williams turns his attention to Matthew Stafford, Rams",
      "author": "Updated [hour]:[minute] [AMPM] [timezone], [monthFull] [day], [year] [deltaHours] hours ago Yesterday [monthFull] [day] [monthFull] [day], [year] [deltaMinutes] mins ago Now",
      "source": "AP News",
      "sourceUrl": "https://apnews.com/article/chicago-bears-caleb-williams-197d0a2f101badaffc376d1668b4f3c4",
      "publishedAt": null,
      "excerpt": null,
      "content": "",
      "scrapedAt": "2026-02-26T13:17:45.612Z"
    },
    {
      "id": "6fcf37e4d32cd7f8",
      "title": "Bears, Patriots latest to provide hope of quick turnarounds for NFL’s 18 non-playoff teams",
      "author": "Updated [hour]:[minute] [AMPM] [timezone], [monthFull] [day], [year] [deltaHours] hours ago Yesterday [monthFull] [day] [monthFull] [day], [year] [deltaMinutes] mins ago Now",
      "source": "AP News",
      "sourceUrl": "https://apnews.com/article/nfl-coach-quarterback-fired-playoffs-5e91bc36b61584fd5a1db070cd4bd041",
      "publishedAt": null,
      "excerpt": null,
      "content": "",
      "scrapedAt": "2026-02-26T13:17:45.612Z"
    },
    {
      "id": "963f9b61416eade2",
      "title": "NFL’s wild-card weekend was full of fourth-down fun and folly along with a dearth of punts",
      "author": "Updated [hour]:[minute] [AMPM] [timezone], [monthFull] [day], [year] [deltaHours] hours ago Yesterday [monthFull] [day] [monthFull] [day], [year] [deltaMinutes] mins ago Now",
      "source": "AP News",
      "sourceUrl": "https://apnews.com/article/nfl-playoffs-fourth-down-820013ea9fa05ef4d3c4bcec92f73343",
      "publishedAt": null,
      "excerpt": null,
      "content": "",
      "scrapedAt": "2026-02-26T13:17:45.612Z"
    },
    {
      "id": "68c46546327fe41f",
      "title": "Packers’ inability to protect leads down the stretch proves costly in wild-card loss at Chicago",
      "author": "Updated [hour]:[minute] [AMPM] [timezone], [monthFull] [day], [year] [deltaHours] hours ago Yesterday [monthFull] [day] [monthFull] [day], [year] [deltaMinutes] mins ago Now",
      "source": "AP News",
      "sourceUrl": "https://apnews.com/article/green-bay-packers-8b60cf2edb1ac0f080aff6782406e5fe",
      "publishedAt": null,
      "excerpt": null,
      "content": "",
      "scrapedAt": "2026-02-26T13:17:45.613Z"
    },
    {
      "id": "ce84e5dee2af83f0",
      "title": "Bears coach Ben Johnson offers no apologies for profane postgame speech",
      "author": "Updated [hour]:[minute] [AMPM] [timezone], [monthFull] [day], [year] [deltaHours] hours ago Yesterday [monthFull] [day] [monthFull] [day], [year] [deltaMinutes] mins ago Now",
      "source": "AP News",
      "sourceUrl": "https://apnews.com/article/chicago-bears-playoffs-ben-johnson-aef00396ce8069c2717cf3b97a574487",
      "publishedAt": null,
      "excerpt": null,
      "content": "",
      "scrapedAt": "2026-02-26T13:17:45.613Z"
    },
    {
      "id": "24b2951e17efa061",
      "title": "Ravens interview Chiefs offensive coordinator, former Bears coach Matt Nagy for coaching vacancy",
      "author": "Updated [hour]:[minute] [AMPM] [timezone], [monthFull] [day], [year] [deltaHours] hours ago Yesterday [monthFull] [day] [monthFull] [day], [year] [deltaMinutes] mins ago Now",
      "source": "AP News",
      "sourceUrl": "https://apnews.com/article/baltimore-ravens-coach-search-cbdf64057bd2f75629569b1d53aa8ded",
      "publishedAt": null,
      "excerpt": null,
      "content": "",
      "scrapedAt": "2026-02-26T13:17:45.613Z"
    },
    {
      "id": "32721377cd8dfcac",
      "title": "Matt LaFleur and the Packers face uncertain future after blowing big lead in wild-card loss",
      "author": "Updated [hour]:[minute] [AMPM] [timezone], [monthFull] [day], [year] [deltaHours] hours ago Yesterday [monthFull] [day] [monthFull] [day], [year] [deltaMinutes] mins ago Now 14",
      "source": "AP News",
      "sourceUrl": "https://apnews.com/article/packers-matt-lafleur-bears-loss-nfl-d117e2e511c739563f9e46fa5311d29f",
      "publishedAt": null,
      "excerpt": null,
      "content": "",
      "scrapedAt": "2026-02-26T13:17:45.613Z"
    },
    {
      "id": "6355a9d83aa4b396",
      "title": "Caleb Williams rallies Bears from 18 points down for 31-27 playoff win over rival Packers",
      "author": "Updated [hour]:[minute] [AMPM] [timezone], [monthFull] [day], [year] [deltaHours] hours ago Yesterday [monthFull] [day] [monthFull] [day], [year] [deltaMinutes] mins ago Now",
      "source": "AP News",
      "sourceUrl": "https://apnews.com/article/packers-bears-score-nfl-playoffs-7729bbfcab314e6eef5bf7b1bba4cdef",
      "publishedAt": null,
      "excerpt": null,
      "content": "",
      "scrapedAt": "2026-02-26T13:17:45.614Z"
    },
    {
      "id": "c301c127341be94c",
      "title": "Bears linebacker T.J. Edwards to miss the rest of the season with leg injury",
      "author": "Updated [hour]:[minute] [AMPM] [timezone], [monthFull] [day], [year] [deltaHours] hours ago Yesterday [monthFull] [day] [monthFull] [day], [year] [deltaMinutes] mins ago Now",
      "source": "AP News",
      "sourceUrl": "https://apnews.com/article/bears-tj-edwards-injury-packers-34dcadc21bb1bb7fb2639c8307220124",
      "publishedAt": null,
      "excerpt": null,
      "content": "",
      "scrapedAt": "2026-02-26T13:17:45.614Z"
    },
    {
      "id": "cbd4a2cf525b8c1f",
      "title": "Texans, Patriots, 49ers, Bills, Bears and Rams advance to NFL’s divisional round",
      "author": "Updated [hour]:[minute] [AMPM] [timezone], [monthFull] [day], [year] [deltaHours] hours ago Yesterday [monthFull] [day] [monthFull] [day], [year] [deltaMinutes] mins ago Now",
      "source": "AP News",
      "sourceUrl": "https://apnews.com/article/nfl-wild-card-weekend-fcec51bd8cf91133f368051ff60c3cbe",
      "publishedAt": null,
      "excerpt": null,
      "content": "",
      "scrapedAt": "2026-02-26T13:17:45.614Z"
    },
    {
      "id": "81e197689eb118fc",
      "title": "Packers hold out RT Zach Tom and Bears activate CB Kyler Gordon for playoff game",
      "author": "Updated [hour]:[minute] [AMPM] [timezone], [monthFull] [day], [year] [deltaHours] hours ago Yesterday [monthFull] [day] [monthFull] [day], [year] [deltaMinutes] mins ago Now",
      "source": "AP News",
      "sourceUrl": "https://apnews.com/article/packers-bears-injuries-gordon-tom-dee907b212b6c639219882226c7d6574",
      "publishedAt": null,
      "excerpt": null,
      "content": "",
      "scrapedAt": "2026-02-26T13:17:45.614Z"
    },
    {
      "id": "f13c186795281d67",
      "title": "Packers and Bears to meet for a rare playoff game in NFL’s longest rivalry",
      "author": "Updated [hour]:[minute] [AMPM] [timezone], [monthFull] [day], [year] [deltaHours] hours ago Yesterday [monthFull] [day] [monthFull] [day], [year] [deltaMinutes] mins ago Now",
      "source": "AP News",
      "sourceUrl": "https://apnews.com/article/packers-bears-preview-26f32d817db4bdd63841df7bda4bc152",
      "publishedAt": null,
      "excerpt": null,
      "content": "",
      "scrapedAt": "2026-02-26T13:17:45.615Z"
    },
    {
      "id": "dd707c50b364f9e6",
      "title": "For Bears and Packers, wild-card game is a rare playoff matchup in NFL’s longest-running rivalry",
      "author": "Updated [hour]:[minute] [AMPM] [timezone], [monthFull] [day], [year] [deltaHours] hours ago Yesterday [monthFull] [day] [monthFull] [day], [year] [deltaMinutes] mins ago Now",
      "source": "AP News",
      "sourceUrl": "https://apnews.com/article/packers-bears-preview-capsule-ee3926b4ae0131ada0457352a7dbbb37",
      "publishedAt": null,
      "excerpt": null,
      "content": "",
      "scrapedAt": "2026-02-26T13:17:45.615Z"
    },
    {
      "id": "3f01ccc63e6c069a",
      "title": "Packers’ Jordan Love believes he’s learned from previous playoff disappointments",
      "author": "Updated [hour]:[minute] [AMPM] [timezone], [monthFull] [day], [year] [deltaHours] hours ago Yesterday [monthFull] [day] [monthFull] [day], [year] [deltaMinutes] mins ago Now",
      "source": "AP News",
      "sourceUrl": "https://apnews.com/article/green-bay-packers-jordan-love-fb098f3f2cd5d7e7a9dfce04a7045fa9",
      "publishedAt": null,
      "excerpt": null,
      "content": "",
      "scrapedAt": "2026-02-26T13:17:45.615Z"
    },
    {
      "id": "ad5495eb5321fe0a",
      "title": "Bears’ Rome Odunze and Kyler Gordon appear poised to return against Packers",
      "author": "Updated [hour]:[minute] [AMPM] [timezone], [monthFull] [day], [year] [deltaHours] hours ago Yesterday [monthFull] [day] [monthFull] [day], [year] [deltaMinutes] mins ago Now",
      "source": "AP News",
      "sourceUrl": "https://apnews.com/article/chicago-bears-rome-odunze-kyler-gordon-3aa9866f1820bb6fdaf96eac2946acce",
      "publishedAt": null,
      "excerpt": null,
      "content": "",
      "scrapedAt": "2026-02-26T13:17:45.616Z"
    },
    {
      "id": "6e7ccf46e19da0d6",
      "title": "Packers optimistic that offensive tackle Zach Tom will return for wild-card game at Bears",
      "author": "Updated [hour]:[minute] [AMPM] [timezone], [monthFull] [day], [year] [deltaHours] hours ago Yesterday [monthFull] [day] [monthFull] [day], [year] [deltaMinutes] mins ago Now",
      "source": "AP News",
      "sourceUrl": "https://apnews.com/article/green-bay-packers-3eacb695f9371b7ed71ed2ed7b22fd72",
      "publishedAt": null,
      "excerpt": null,
      "content": "",
      "scrapedAt": "2026-02-26T13:17:45.616Z"
    },
    {
      "id": "eb986387eceb8bd9",
      "title": "Chicago Bears look for better start against the Green Bay Packers in prime-time playoff opener",
      "author": "Updated [hour]:[minute] [AMPM] [timezone], [monthFull] [day], [year] [deltaHours] hours ago Yesterday [monthFull] [day] [monthFull] [day], [year] [deltaMinutes] mins ago Now",
      "source": "AP News",
      "sourceUrl": "https://apnews.com/article/bears-defense-packers-nfl-playoffs-1a79803941b1d811ec9791d6d0fbcb73",
      "publishedAt": null,
      "excerpt": null,
      "content": "",
      "scrapedAt": "2026-02-26T13:17:45.616Z"
    },
    {
      "id": "b830b6f7ab06bad4",
      "title": "Missing playoffs, Lions fall short of expectations and preseason predictions for Campbell’s team",
      "author": "Updated [hour]:[minute] [AMPM] [timezone], [monthFull] [day], [year] [deltaHours] hours ago Yesterday [monthFull] [day] [monthFull] [day], [year] [deltaMinutes] mins ago Now",
      "source": "AP News",
      "sourceUrl": "https://apnews.com/article/detroit-lions-16b1495a6a4576edcb007cbcfb5f45c3",
      "publishedAt": null,
      "excerpt": null,
      "content": "",
      "scrapedAt": "2026-02-26T13:17:45.616Z"
    },
    {
      "id": "67a9d8338b955c30",
      "title": "Bears look to regroup for playoffs after closing regular season with 2 straight losses",
      "author": "Updated [hour]:[minute] [AMPM] [timezone], [monthFull] [day], [year] [deltaHours] hours ago Yesterday [monthFull] [day] [monthFull] [day], [year] [deltaMinutes] mins ago Now",
      "source": "AP News",
      "sourceUrl": "https://apnews.com/article/chicago-bears-analysis-eea7937702712adaec87add7ffc05c68",
      "publishedAt": null,
      "excerpt": null,
      "content": "",
      "scrapedAt": "2026-02-26T13:17:45.616Z"
    },
    {
      "id": "5bfb289b82340b99",
      "title": "Packers ready for new start in playoffs after closing regular season with four straight losses",
      "author": "Updated [hour]:[minute] [AMPM] [timezone], [monthFull] [day], [year] [deltaHours] hours ago Yesterday [monthFull] [day] [monthFull] [day], [year] [deltaMinutes] mins ago Now",
      "source": "AP News",
      "sourceUrl": "https://apnews.com/article/packers-playoffs-f4b1619f1dd8b1aaddf3068c05dc8005",
      "publishedAt": null,
      "excerpt": null,
      "content": "",
      "scrapedAt": "2026-02-26T13:17:45.617Z"
    },
    {
      "id": "3cd762c73385973d",
      "title": "Caleb Williams breaks Bears single-season passing record in loss to Lions",
      "author": "Updated [hour]:[minute] [AMPM] [timezone], [monthFull] [day], [year] [deltaHours] hours ago Yesterday [monthFull] [day] [monthFull] [day], [year] [deltaMinutes] mins ago Now",
      "source": "AP News",
      "sourceUrl": "https://apnews.com/article/bears-caleb-williams-d3fe2cf475ddbae5865950a71dd5d4a8",
      "publishedAt": null,
      "excerpt": null,
      "content": "",
      "scrapedAt": "2026-02-26T13:17:45.617Z"
    },
    {
      "id": "94a17ae19cdda9d7",
      "title": "Lions beat playoff-bound Bears 19-16 on Bates’ 42-yard field goal as time expires",
      "author": "Updated [hour]:[minute] [AMPM] [timezone], [monthFull] [day], [year] [deltaHours] hours ago Yesterday [monthFull] [day] [monthFull] [day], [year] [deltaMinutes] mins ago Now",
      "source": "AP News",
      "sourceUrl": "https://apnews.com/article/lions-bears-score-d78dc35d81b1af25f82ee754c399d4ae",
      "publishedAt": null,
      "excerpt": null,
      "content": "",
      "scrapedAt": "2026-02-25T13:17:04.355Z"
    },
    {
      "id": "53788826f82ddf4a",
      "title": "Chicago Bears stadium bill now includes union-friendly language",
      "author": null,
      "source": "Chicago Tribune",
      "sourceUrl": "https://www.chicagotribune.com/2026/02/20/chicago-bears-stadium-bill-now-includes-union-friendly-language/",
      "publishedAt": null,
      "excerpt": null,
      "content": "",
      "scrapedAt": "2026-02-23T13:16:39.397Z"
    },
    {
      "id": "043e7895cf600f61",
      "title": "Gov. JB Pritzker suggests no matter how Indiana vs. Illinois fight goes, new Bears home won’t be in Chicago",
      "author": null,
      "source": "Chicago Tribune",
      "sourceUrl": "https://www.chicagotribune.com/2026/02/20/pritzker-bears-stadium-not-chicago/",
      "publishedAt": null,
      "excerpt": null,
      "content": "",
      "scrapedAt": "2026-02-22T13:00:36.173Z"
    },
    {
      "id": "6c71cbfa6e3883f2",
      "title": "Wherever the Chicago Bears’ next stadium will be located, Halas Hall will stay in Lake Forest, team says",
      "author": null,
      "source": "Chicago Tribune",
      "sourceUrl": "https://www.chicagotribune.com/2026/02/20/chicago-bears-lake-forest-halas-hall-2/",
      "publishedAt": null,
      "excerpt": null,
      "content": "",
      "scrapedAt": "2026-02-21T12:59:02.682Z"
    },
    {
      "id": "1db15c582b67ad89",
      "title": "‘Once-in-a-generation opportunity’: Indiana leaders tout Hammond site, a 20-minute drive from Soldier Field",
      "author": null,
      "source": "Chicago Tribune",
      "sourceUrl": "https://www.chicagotribune.com/2026/02/20/chicago-bears-eye-hammond-stadium-as-bill-passes-house-committee/",
      "publishedAt": null,
      "excerpt": null,
      "content": "",
      "scrapedAt": "2026-02-21T12:59:02.683Z"
    },
    {
      "id": "f875a97719aff96f",
      "title": "Latest First Alert Weather Forecast",
      "author": null,
      "source": "CBS Chicago",
      "sourceUrl": "https://www.cbsnews.com/chicago/weather/",
      "publishedAt": null,
      "excerpt": null,
      "content": "",
      "scrapedAt": "2026-02-21T03:35:22.834Z"
    },
    {
      "id": "d1c75e7c2244166a",
      "title": "First Alert Radar",
      "author": null,
      "source": "CBS Chicago",
      "sourceUrl": "https://www.cbsnews.com/chicago/weather/cbs-chicago-radar/",
      "publishedAt": null,
      "excerpt": null,
      "content": "",
      "scrapedAt": "2026-02-21T03:35:22.834Z"
    },
    {
      "id": "e2ed5067ae3276aa",
      "title": "Local Weather Temperatures",
      "author": null,
      "source": "CBS Chicago",
      "sourceUrl": "https://www.cbsnews.com/chicago/weather/local-temperature/",
      "publishedAt": null,
      "excerpt": null,
      "content": "",
      "scrapedAt": "2026-02-21T03:35:22.834Z"
    },
    {
      "id": "e20d36d8d68e9058",
      "title": "National Weather Temperatures",
      "author": null,
      "source": "CBS Chicago",
      "sourceUrl": "https://www.cbsnews.com/chicago/weather/national-temperatures/",
      "publishedAt": null,
      "excerpt": null,
      "content": "",
      "scrapedAt": "2026-02-21T03:35:22.835Z"
    },
    {
      "id": "9b1b0edd9c307425",
      "title": "Contact Us",
      "author": null,
      "source": "CBS Chicago",
      "sourceUrl": "https://www.cbsnews.com/chicago/cbschicago/",
      "publishedAt": null,
      "excerpt": null,
      "content": "",
      "scrapedAt": "2026-02-21T03:35:22.838Z"
    },
    {
      "id": "8f8abccc3dca05c3",
      "title": "Stream CBS News Chicago",
      "author": null,
      "source": "CBS Chicago",
      "sourceUrl": "https://www.cbsnews.com/chicago/live/",
      "publishedAt": null,
      "excerpt": null,
      "content": "",
      "scrapedAt": "2026-02-21T03:35:22.838Z"
    },
    {
      "id": "0b7f31f0f8692e2a",
      "title": "Contests & Promotions",
      "author": null,
      "source": "CBS Chicago",
      "sourceUrl": "https://www.cbsnews.com/chicago/contests/",
      "publishedAt": null,
      "excerpt": null,
      "content": "",
      "scrapedAt": "2026-02-21T03:35:22.838Z"
    },
    {
      "id": "11c8135c5f236438",
      "title": "Advertise with CBS News Chicago",
      "author": null,
      "source": "CBS Chicago",
      "sourceUrl": "https://www.cbsnews.com/chicago/advertise/",
      "publishedAt": null,
      "excerpt": null,
      "content": "",
      "scrapedAt": "2026-02-21T03:35:22.838Z"
    },
    {
      "id": "22b30040b41687f6",
      "title": "Chicago Sports",
      "author": null,
      "source": "CHGO Sports",
      "sourceUrl": "https://www.amazon.com/Best-Sellers-Audible-Audiobooks/zgbs/audible?_encoding=UTF8&linkCode=ll2&tag=acheader1-20&linkId=848b5795c807ca8dfbe30825d2eb8495&language=en_US&ref_=as_li_ss_tl",
      "publishedAt": null,
      "excerpt": "ALL SPORTS",
      "content": "ALL SPORTS",
      "scrapedAt": "2026-02-21T03:35:23.598Z"
    },
    {
      "id": "389bc2805c065317",
      "title": "Column: Chicago Bears are headed to Indiana — for football, not politics. 6 topics for the NFL combine.",
      "author": null,
      "source": "Chicago Tribune",
      "sourceUrl": "https://www.chicagotribune.com/2026/02/22/chicago-bears-nfl-scouting-combine/",
      "publishedAt": null,
      "excerpt": null,
      "content": "",
      "scrapedAt": "2026-02-23T13:16:39.396Z"
    },
    {
      "id": "d9a3322b70cc0d9c",
      "title": "Arlington Heights? Hammond? Chicago Bears could join 10 NFL franchises who left namesake cities for suburbs.",
      "author": null,
      "source": "Chicago Tribune",
      "sourceUrl": "https://www.chicagotribune.com/2026/02/22/chicago-bears-hammond-nfl-stadiums-namesake-cities/",
      "publishedAt": null,
      "excerpt": null,
      "content": "",
      "scrapedAt": "2026-02-23T13:16:39.397Z"
    },
    {
      "id": "d2fbbb1f4e1ca67e",
      "title": "NFL combine: Looking at the Chicago Bears’ positions of need — and the prospects who could fill them",
      "author": null,
      "source": "Chicago Tribune",
      "sourceUrl": "https://www.chicagotribune.com/2026/02/23/chicago-bears-nfl-scouting-combine-draft/",
      "publishedAt": null,
      "excerpt": null,
      "content": "",
      "scrapedAt": "2026-02-24T13:18:04.481Z"
    },
    {
      "id": "8fddcd25e4db38e8",
      "title": "Chicago Park District pushes $630M plan to revamp Soldier Field post-Bears",
      "author": null,
      "source": "Chicago Tribune",
      "sourceUrl": "https://www.chicagotribune.com/2026/02/23/chicago-park-district-plan-revamp-soldier-field-post-bears/",
      "publishedAt": null,
      "excerpt": null,
      "content": "",
      "scrapedAt": "2026-02-24T13:18:04.480Z"
    },
    {
      "id": "2ee327ad984c9631",
      "title": "Chicago Bears stadium bill gets initial approval from Indiana House with minor amendment",
      "author": null,
      "source": "Chicago Tribune",
      "sourceUrl": "https://www.chicagotribune.com/2026/02/23/indiana-chicago-bears-stadium-bill/",
      "publishedAt": null,
      "excerpt": null,
      "content": "",
      "scrapedAt": "2026-02-24T13:18:04.480Z"
    },
    {
      "id": "ffe80db0a22a39f2",
      "title": "What to know about the Chicago Bears’ possible move from Soldier Field",
      "author": null,
      "source": "Chicago Tribune",
      "sourceUrl": "https://www.chicagotribune.com/2026/02/23/chicago-bears-soldier-field-stadium-news/",
      "publishedAt": null,
      "excerpt": null,
      "content": "",
      "scrapedAt": "2026-02-24T13:18:04.480Z"
    },
    {
      "id": "86cd84b69d865e07",
      "title": "Chicago Bears stadium news: Indiana bill that outlines financial structure passes House",
      "author": null,
      "source": "Chicago Tribune",
      "sourceUrl": "https://www.chicagotribune.com/2026/02/24/indiana-bears-stadium-bill-passes-house-nears-end-zone/",
      "publishedAt": null,
      "excerpt": null,
      "content": "",
      "scrapedAt": "2026-02-26T13:17:58.239Z"
    },
    {
      "id": "42c2269176480226",
      "title": "Column: Chicago Bears are open for business as GM Ryan Poles considers all options to restock the roster",
      "author": null,
      "source": "Chicago Tribune",
      "sourceUrl": "https://www.chicagotribune.com/2026/02/24/chicago-bears-ryan-poles-ben-johnson-roster/",
      "publishedAt": null,
      "excerpt": null,
      "content": "",
      "scrapedAt": "2026-02-26T13:17:58.239Z"
    },
    {
      "id": "50443cd321290e19",
      "title": "Would the Chicago Bears trade Tyson Bagent? GM Ryan Poles has fielded calls about the backup QB.",
      "author": null,
      "source": "Chicago Tribune",
      "sourceUrl": "https://www.chicagotribune.com/2026/02/24/chicago-bears-ryan-poles-tyson-bagent/",
      "publishedAt": null,
      "excerpt": null,
      "content": "",
      "scrapedAt": "2026-02-25T13:17:15.404Z"
    },
    {
      "id": "110e6e05f2ff5053",
      "title": "Chicago Bears may be in line for compensatory draft picks, GMs Ryan Poles and Ian Cunningham say",
      "author": null,
      "source": "Chicago Tribune",
      "sourceUrl": "https://www.chicagotribune.com/2026/02/24/chicago-bears-ryan-poles-combine/",
      "publishedAt": null,
      "excerpt": null,
      "content": "",
      "scrapedAt": "2026-02-25T13:17:15.404Z"
    },
    {
      "id": "a84ea51dbdd7a2b3",
      "title": "Chicago Bears grant linebacker Tremaine Edmunds permission to seek a trade",
      "author": "Updated [hour]:[minute] [AMPM] [timezone], [monthFull] [day], [year] [deltaHours] hours ago Yesterday [monthFull] [day] [monthFull] [day], [year] [deltaMinutes] mins ago Now",
      "source": "AP News",
      "sourceUrl": "https://apnews.com/article/chicago-bears-tremaine-edmunds-trade-537c0f31fa395da834995d986a7b7f92",
      "publishedAt": null,
      "excerpt": null,
      "content": "CHICAGO (AP) — The Chicago Bears have agreed to let linebacker Tremaine Edmunds seek a trade, agent Todd France said Wednesday.The 27-year-old Edmunds is entering the final season of a four-year, $72 million contract he signed in 2023 and could be released if he doesn’t find a trade partner. He has a $17.4 million salary cap hit for next season, but the Bears would save $15 million in cap space by letting him go before the start of the league year next month. The Chicago Tribune first reported the Bears have agreed to allow Edmunds to seek a trade.Edmunds helped the Bears go from worst to first in the NFC North. He led the team with 112 tackles despite missing four games with a groin injury and had four interceptions.Chicago went 11-6 and won its first division title since 2018 after finishing last in the NFC North the previous season. The Bears advanced in the playoffs for the first time in 15 years, rallying to beat Green Bay in a wild-card thriller before losing to the Los Angeles Rams in overtime in the divisional round.___AP NFL: https://apnews.com/hub/NFL",
      "scrapedAt": "2026-02-26T13:17:45.605Z"
    },
    {
      "id": "238e303301355acb",
      "title": "Tremaine Edmunds has permission to seek a trade. What it means for the Chicago Bears’ salary cap and needs.",
      "author": null,
      "source": "Chicago Tribune",
      "sourceUrl": "https://www.chicagotribune.com/2026/02/25/chicago-bears-tremaine-edmunds-trade/",
      "publishedAt": null,
      "excerpt": null,
      "content": "",
      "scrapedAt": "2026-02-26T13:17:58.239Z"
    },
    {
      "id": "0d98a9cc52a1f66a",
      "title": "What we learned from the Chicago Bears at NFL combine, including Ryan Poles’ thoughts on DJ Moore’s future",
      "author": null,
      "source": "Chicago Tribune",
      "sourceUrl": "https://www.chicagotribune.com/2026/02/25/chicago-bears-nfl-combine-dj-moore/",
      "publishedAt": null,
      "excerpt": null,
      "content": "",
      "scrapedAt": "2026-02-26T13:17:58.239Z"
    }
  ]
}