{
  "lastUpdated": "2026-02-17T06:00:00Z",
  "articles": [
    {
      "id": "article-1",
      "title": "Bears 2025 position review: Defensive line",
      "author": "Gabby Hajduk",
      "source": "chicagobears.com",
      "sourceUrl": "https://chicagobears.com/",
      "publishedAt": "2026-02-16T14:30:00Z",
      "excerpt": "While the Bears defensive line dealt with myriad injuries throughout the season, several players stepped up, particularly late in the year.",
      "content": "While the Bears defensive line dealt with myriad injuries throughout the season, several players stepped up, particularly late in the year.\n\nMontez Sweat led the group with 10.0 sacks, 18 quarterback hits, 13 tackles-for-loss and three forced fumbles, which equaled his career best. It marked the second time Sweat reached double-digit sacks in his career (2023), and his first time doing so with one team.\n\nThe majority of Sweat's production occurred after the bye week, something coach Ben Johnson repeatedly discussed as a difference maker for the Bears defense.\n\n\"He's a guy that we count on,\" Johnson said late in the season. \"I know the sack numbers is what everybody looks at when it comes to edge rushers, and he's at double digits. He's played really good football in that regard, but as I've told him, as the year has gone along, for me it's not just the sacks, it's also the pressures and the quarterback hits.\n\n\"When you're watching from the sideline and you're feeling him affecting the quarterback, a different type of way I do think that's really important. He's stepped up. I've felt like that since the bye week. He's playing really good in the running game – that gets overlooked – but also in the passing game. I felt him get after the quarterback a little bit more.\"\n\nSweat recorded his best performance Nov. 23 in a 31-28 win over Pittsburgh. Heading into the Week 12 game, the veteran had recorded a sack in four of the previous five contests and tallied two more against the Steelers, including a strip-sack which he recovered himself.\n\nSweat also made an impact in the Bears' two playoff games, playing a season-high 82.1% of snaps against the Rams and 80.3% of snaps, his third highest, against the Packers. In the Wild Card Round, he recorded three quarterback hits and a batted pass and registered a sack of Los Angeles quarterback Matthew Stafford in the Divisional Round.\n\n\"I thought Sweat did a good job this year,\" general manager Ryan Poles said. \"I think sometimes we get hung up on sacks, and sacks are important. He did get into double digits, but I think his all-around game was good. The way he defended the run, defended the perimeter, as well as applied pressure, was good. We need him to continue to get better, too.\"\n\nIn the first half of the season, veteran Dayo Odeyingbo played opposite Sweat and recorded 21 tackles, 1.0 sack and four QB hits before suffering an Achilles injury against the Bengals Nov. 2 that sidelines him for the remainder of the season.",
      "keywords": ["Bears", "defensive line", "Sweat", "defense"]
    },
    {
      "id": "article-2",
      "title": "Bears RB D'Andre Swift hopes he convinced team to keep him heading into last year of contract",
      "author": "Jason Lieser",
      "source": "Chicago Sun-Times",
      "sourceUrl": "https://www.chicagosuntimes.com/",
      "publishedAt": "2026-02-16T13:15:00Z",
      "excerpt": "A do-it-all running back is an essential for the Bears in coach Ben Johnson's offense, and they might already have one in D'Andre Swift.",
      "content": "A do-it-all running back is an essential for the Bears in coach Ben Johnson's offense, and they might already have one in D'Andre Swift.\n\nHe completely flipped the outlook on whether he's a good fit with a renewed north-south running style and a 1,000-yard season after a disappointing 2024 and now, rather than eying the relatively cheap $1.3 million out on his contract this offseason, the Bears have him on board at an affordable $8.8 million this season.\n\nSwift knows there's some uncertainty, but made a strong case to stay with a career-high 1,087 yards and nine touchdowns.\n\n\"I have no idea, but hopefully I did enough for them to want me back because I know I don't want to go anywhere else,\" he told the Sun-Times. \"I hope it plays itself out that way. I love the city, I love the coaching staff and the men that I work with. That's out of my control, but if I had it my way, I'd be back. I don't want to play nowhere else.\"\n\nJohnson played a major part in Swift's success and his desire to remain with the Bears, which was interesting given their history. While Johnson has maintained he has always seen high potential in Swift, he was part of the Lions' coaching staff when they traded him to the Eagles for a fourth-round pick in 2023.\n\nIn Swift's first season with the Bears, albeit amid dysfunction in coach Matt Eberflus' staff and with a struggling offensive line, he often seemed too reliant on running laterally to look for big gains rather than hitting the holes quickly. Swift has said he didn't change his running style at all this season, but his yards per carry jumped from 3.8 to 4.9 in a more effective system and with a significantly upgraded offensive line.\n\n\"First of all, Ben always believed in me as a player, so just him giving me opportunities was great,\" Swift said. \"The more opportunities I'm given, the more I can make stuff happen.\" It's hard to deny the impact of former running backs coach Eric Bieniemy as well, and Swift said he was \"sad to see him leave\" for the Chiefs as offensive coordinator. The Bears have agreed to hire veteran coach Eric Studesville to replace him, and Swift was \"excited for this new relationship.\"",
      "keywords": ["Bears", "running back", "D'Andre Swift", "contract", "Ben Johnson"]
    },
    {
      "id": "article-3",
      "title": "Bears face big free agent decisions",
      "author": "Michal Dwojak",
      "source": "Daily Herald",
      "sourceUrl": "https://www.dailyherald.com/",
      "publishedAt": "2026-02-16T12:45:00Z",
      "excerpt": "It's time for the Bears to move on. Head coach Ben Johnson and general manager Ryan Poles will spend the offseason looking to make moves to help the Bears take another big step next season.",
      "content": "It's time for the Bears to move on.\n\nHead coach Ben Johnson and general manager Ryan Poles will spend the offseason looking to make moves to help the Bears take another big step next season.\n\nSome of the key decisions will be what to do with the free agents on their roster. The Bears will likely have to make some tough salary cap decisions and won't franchise tag any of their free agents.\n\nTeams can start negotiating with unrestricted free agents on March 9 and officially sign players on March 11 when the new league starts. Here's a look at three key players on the Bears' roster who are set to become free agents next month.\n\nKevin Byard\n\nByard was one of four safeties on the Bears roster who entered 2025 on the last year of their contract with something to prove. He did so and more as Byard showed he can be an impact player even as he entered the second half of his career.\n\nByard was a leader for a secondary that helped the defense lead the league in takeaways and interceptions. He led the NFL with a career-high seven interceptions while playing at 32 years old. That strong play earned Byard his third All-Pro and Pro Bowl honors.\n\nIt happened as Byard invested time in the film room to create those turnovers. Byard studied quarterbacks' tendencies to make up for any physical parts of his games that might've slowed down.\n\nNow the Bears need to decide whether to bring back Byard. There likely won't be a top-dollar market even after Byard's career year because of his age.\n\nNahshon Wright\n\nNot much was expected when the Bears signed Wright to a one-year contract last offseason. Chicago was Wright's third team in five years and he came to the team because of a previous relationship with Bears defensive backs/passing game coordinator Al Harris.\n\nBut Wright stepped in when the Bears needed him to and lived up to his potential when he started in place for injured Jaylon Johnson for most of the season. His length helped him haul in a career-high five interceptions, which tied for second in the NFL. Wright also forced two fumbles, none more memorable than against the Philadelphia Eagles on a \"tush push\" play. He earned his first Pro Bowl honor.",
      "keywords": ["Bears", "free agent", "decisions", "offseason", "Byard"]
    }
  ]
}
